import { ModalBtn, ModalContainer, ModalWind } from "./StartModal.styled";

const GameModal = ({ onClose }) => {
  return (
    <ModalContainer className="modal-overlay">
      <ModalWind className="modal">
        <h2>Ласкаво просимо у гру!</h2>
        <p>
          Основний квест: "Шість Печаток Долі" Світ занурений у темряву після пробудження Древнього Лорда Руїни. Його тінь
          розростається, пожираючи міста і душі. Єдиний спосіб зупинити його — зібрати шість Елементів Сили, які розкидані по
          світу і захищені могутніми стражами. Шість Елементів Сили: Вогонь Першопредків — знаходиться в глибинах Вулкану
          Скорботи, охороняється вогненним титаном Аґралом. Лід Вічності — прихований у Замерзлому Соборі, де бродять душі
          загублених паломників. Серце Землі — заховане у Священному Гаю, охороняється Древнім Дубом та його вартачами. Дихання
          Бурі — знаходиться на вершині Штормового Піка, де невгамовний вітер може зірвати навіть найвідважнішого. Тінь Забуття —
          захована у руїнах Загубленого Королівства, де мешкають привиди стародавніх воїнів. Сяйво Душі — сховане у Залі Вічного
          Світла, де потрібно пройти випробування мудрості та відданості. Після збору всіх елементів герой зможе викликати зброю
          "Меч Долі", єдину, що здатна знищити Лорда Руїни.
        </p>
        <ModalBtn onClick={onClose}>Почати гру</ModalBtn>
      </ModalWind>
    </ModalContainer>
  );
};
export default GameModal;
